## Plan for terraform
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                               |
|--------|------------------------------------------------------------------|
| add    | `aws_ecr_lifecycle_policy.website_staging_untagged`              |
|        | `aws_ecr_repository.threat_modeling_pr_review`                   |
|        | `aws_iam_policy.pr-review-env-lambda`                            |
|        | `aws_iam_policy.pr_review_env`                                   |
|        | `aws_iam_role.pr-review-env-lambda`                              |
|        | `aws_iam_role_policy_attachment.pr-review-env-lambda`            |
|        | `aws_iam_role_policy_attachment.pr_review_env`                   |
|        | `module.pr_review_env.aws_iam_role.this[&quot;pr-review-env-manage&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecr_image_manage will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecr_image_manage" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchDeleteImage",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:GetRepositoryPolicy",
              + "ecr:InitiateLayerUpload",
              + "ecr:ListImages",
              + "ecr:PutImage",
              + "ecr:SetRepositoryPolicy",
              + "ecr:UploadLayerPart",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # data.aws_iam_policy_document.lambda_function_manage will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_function_manage" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:AddPermission",
              + "lambda:CreateFunction",
              + "lambda:CreateFunctionUrlConfig",
              + "lambda:DeleteFunction",
              + "lambda:DeleteFunctionConcurrency",
              + "lambda:DeleteFunctionUrlConfig",
              + "lambda:GetFunction",
              + "lambda:GetFunctionConfiguration",
              + "lambda:GetFunctionUrlConfig",
              + "lambda:ListFunctionUrlConfigs",
              + "lambda:PutFunctionConcurrency",
              + "lambda:UpdateFunctionCode",
              + "lambda:UpdateFunctionConfiguration",
              + "lambda:UpdateFunctionUrlConfig",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:283582579564:function:pr-review-env-*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DeleteLogGroup",
              + "logs:DeleteLogStream",
              + "logs:DeleteRetentionPolicy",
              + "logs:DescribeLogStreams",
              + "logs:PutRetentionPolicy",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:283582579564:log-group:/aws/lambda/pr-review-env-*",
            ]
        }
    }

  # data.aws_iam_policy_document.pr_review_env will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "pr_review_env" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + (known after apply),
          + (known after apply),
        ]
    }

  # aws_ecr_lifecycle_policy.website_staging_untagged will be created
  + resource "aws_ecr_lifecycle_policy" "website_staging_untagged" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire untagged images older than 14 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 14
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 20 tagged images"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber   = 20
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "latest",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "threat-modeling-pr-review"
    }

  # aws_ecr_repository.threat_modeling_pr_review will be created
  + resource "aws_ecr_repository" "threat_modeling_pr_review" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "threat-modeling-pr-review"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_iam_policy.pr-review-env-lambda will be created
  + resource "aws_iam_policy" "pr-review-env-lambda" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "pr-review-env-lambda"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:ca-central-1:283582579564:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_policy.pr_review_env will be created
  + resource "aws_iam_policy" "pr_review_env" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "pr-review-env-manage"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.pr-review-env-lambda will be created
  + resource "aws_iam_role" "pr-review-env-lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pr-review-env-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.pr-review-env-lambda will be created
  + resource "aws_iam_role_policy_attachment" "pr-review-env-lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "pr-review-env-lambda"
    }

  # aws_iam_role_policy_attachment.pr_review_env will be created
  + resource "aws_iam_role_policy_attachment" "pr_review_env" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "pr-review-env-manage"
    }

  # module.pr_review_env.aws_iam_role.this["pr-review-env-manage"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/threat-modeling-tool:pull_request"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::283582579564:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pr-review-env-manage"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "threat-modeling-tool"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "threat-modeling-tool"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.threat_modeling_pr_review"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.pr-review-env-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.pr_review_env"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.pr-review-env-lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.website.aws_s3_bucket.this"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
